{"table_name": "Product","description": "Stores information about financial products like Bonds, Interest Rate Swaps, and Credit Default Swaps. Can be joined with trade using column product_id","example_queries": ["List all product types","How many product types are there for which trades are present","How many product types have future chasflows","Which product type does a particular counterparty invests in","Show me the product types which have trades for United States"]}
{"table_name": "Books","description": "Stores information about trading books including name, region, and type. Books are used for governing access over types of trades which can be executed for specific regions. Can be joined with trade on column book_id","example_queries": ["List all book names and their regions","How many books have more than 1 trade","Count the number of books for each region","Which book has the highest notional amount","Which book has no future cashflows"]}
{"table_name": "Trade","description": "Records details of financial trades including product, book, trade date, notional amount, counterparty, trade start date, trade end date, status and currency. Joins with Product and Books tables using product_id and book_id respectively. Use end_date as the column for conditions on status Closed and start_date for status Active. Use trade_date for trade execution date. Notional Amount is the trade amount. Constraints: trade_id is primary key.","example_queries": ["List all trades with their counterparties","Find the product that has the highest number of trades in some currency","Count the number of trades for each counterparty","List trades that have a status of 'Active'","Find the trades that had been closed last month."]}
{"table_name": "Cashflows","description": "Manages cashflow details related to trades including trade_id, cashflow_date, Cashflow amount, cashflow_type, and status. Each trade can have many cashflows. Use cashflow_date for filters on cashflow dates. Joins with Trade table using trade_id. Constraints: cashflow_id is primary key.","example_queries": ["Show the future cashflows for a particular trade","Find all the cashflows for a particlar product and a counterparty","How many cashflows are pending for the current month","Which trade has the highest frequency of cashflows","Which trade has highest cashflows in the floating_leg"]}